foxval/esp-idf/components/soc/esp32c/include/soc/spi_mem_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_SPI_REG_H_
#define _SOC_SPI_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"
#define REG_SPI_BASE(i)     (DR_REG_SPI0_BASE - (i)* 0x1000)

#define SPI_CMD_REG SPI_MEM_CMD_REG
#define SPI_FLASH_READ SPI_MEM_FLASH_READ
#define SPI_FLASH_WREN SPI_MEM_FLASH_WREN
#define SPI_FLASH_WRDI SPI_MEM_FLASH_WRDI
#define SPI_FLASH_RDID  SPI_MEM_FLASH_RDID
#define SPI_FLASH_RDSR  SPI_MEM_FLASH_RDSR
#define SPI_FLASH_WRSR  SPI_MEM_FLASH_WRSR
#define SPI_FLASH_PP  SPI_MEM_FLASH_PP
#define SPI_FLASH_SE  SPI_MEM_FLASH_SE
#define SPI_FLASH_BE  SPI_MEM_FLASH_BE
#define SPI_FLASH_CE  SPI_MEM_FLASH_CE
#define SPI_FLASH_DP  SPI_MEM_FLASH_DP
#define SPI_FLASH_RES SPI_MEM_FLASH_RES
#define SPI_FLASH_HPM  SPI_MEM_FLASH_HPM
#define SPI_USR  SPI_MEM_USR
#define SPI_FLASH_PES  SPI_MEM_FLASH_PES
#define SPI_FLASH_PER  SPI_MEM_FLASH_PER
#define SPI_FLASH_PE  SPI_MEM_FLASH_PE

#define SPI_ADDR_REG SPI_MEM_ADDR_REG

#define SPI_CTRL_REG SPI_MEM_CTRL_REG
#define SPI_FREAD_QIO  SPI_MEM_FREAD_QIO
#define SPI_FREAD_QIO_M  SPI_MEM_FREAD_QIO_M
#define SPI_FREAD_QIO_V  SPI_MEM_FREAD_QIO_V
#define SPI_FREAD_QIO_S  SPI_MEM_FREAD_QIO_S
#define SPI_FREAD_DIO  SPI_MEM_FREAD_DIO
#define SPI_FREAD_DIO_M  SPI_MEM_FREAD_DIO_M
#define SPI_FREAD_DIO_V  SPI_MEM_FREAD_DIO_V
#define SPI_FREAD_DIO_S  SPI_MEM_FREAD_DIO_S
#define SPI_WRSR_2B  SPI_MEM_WRSR_2B
#define SPI_WP_REG  SPI_MEM_WP_REG
#define SPI_WP_REG_M  SPI_MEM_WP_REG_M
#define SPI_WP_REG_V  SPI_MEM_WP_REG_V
#define SPI_WP_REG_S  SPI_MEM_WP_REG_S
#define SPI_FREAD_QUAD  SPI_MEM_FREAD_QUAD
#define SPI_FREAD_QUAD_M  SPI_MEM_FREAD_QUAD_M
#define SPI_FREAD_QUAD_V  SPI_MEM_FREAD_QUAD_V
#define SPI_FREAD_QUAD_S  SPI_MEM_FREAD_QUAD_S
#define SPI_D_POL  SPI_MEM_D_POL
#define SPI_Q_POL  SPI_MEM_Q_POL
#define SPI_FLASH_SUSPENDING  SPI_MEM_FLASH_SUSPENDING
#define SPI_RESANDRES  SPI_MEM_RESANDRES
#define SPI_FREAD_DUAL SPI_MEM_FREAD_DUAL
#define SPI_FREAD_DUAL_M SPI_MEM_FREAD_DUAL_M
#define SPI_FREAD_DUAL_V SPI_MEM_FREAD_DUAL_V
#define SPI_FREAD_DUAL_S SPI_MEM_FREAD_DUAL_S
#define SPI_FASTRD_MODE  SPI_MEM_FASTRD_MODE
#define SPI_WAIT_FLASH_IDLE_EN SPI_MEM_WAIT_FLASH_IDLE_EN
#define SPI_TX_CRC_EN SPI_MEM_TX_CRC_EN
#define SPI_FCS_CRC_EN SPI_MEM_FCS_CRC_EN
#define SPI_FCMD_QUAD  SPI_MEM_FCMD_QUAD
#define SPI_FCMD_DUAL  SPI_MEM_FCMD_DUAL
#define SPI_DUMMY_OUT  SPI_MEM_DUMMY_OUT

#define SPI_CTRL1_REG SPI_MEM_CTRL1_REG
#define SPI_CS_HOLD_DELAY  SPI_MEM_CS_HOLD_DELAY
#define SPI_CS_HOLD_DELAY_M  SPI_MEM_CS_HOLD_DELAY_M
#define SPI_CS_HOLD_DELAY_V  SPI_MEM_CS_HOLD_DELAY_V
#define SPI_CS_HOLD_DELAY_S  SPI_MEM_CS_HOLD_DELAY_S
#define SPI_CS_HOLD_DELAY_RES  SPI_MEM_CS_HOLD_DELAY_RES
#define SPI_CS_HOLD_DELAY_RES_M  SPI_MEM_CS_HOLD_DELAY_RES_M
#define SPI_CS_HOLD_DELAY_RES_V  SPI_MEM_CS_HOLD_DELAY_RES_V
#define SPI_CS_HOLD_DELAY_RES_S  SPI_MEM_CS_HOLD_DELAY_RES_S
#define SPI_CLK_MODE  SPI_MEM_CLK_MODE
#define SPI_CLK_MODE_M  SPI_MEM_CLK_MODE_M
#define SPI_CLK_MODE_V  SPI_MEM_CLK_MODE_V
#define SPI_CLK_MODE_S  SPI_MEM_CLK_MODE_S

#define SPI_CTRL2_REG SPI_MEM_CTRL2_REG
#define SPI_SYNC_RESET SPI_MEM_SYNC_RESET
#define SPI_CS_DELAY_EDGE SPI_MEM_CS_DELAY_EDGE
#define SPI_CS_DELAY_NUM  SPI_MEM_CS_DELAY_NUM
#define SPI_CS_DELAY_NUM_M  SPI_MEM_CS_DELAY_NUM_M
#define SPI_CS_DELAY_NUM_V  SPI_MEM_CS_DELAY_NUM_V
#define SPI_CS_DELAY_NUM_S  SPI_MEM_CS_DELAY_NUM_S
#define SPI_CS_DELAY_MODE  SPI_MEM_CS_DELAY_MODE
#define SPI_CS_DELAY_MODE_M  SPI_MEM_CS_DELAY_MODE_M
#define SPI_CS_DELAY_MODE_V  SPI_MEM_CS_DELAY_MODE_V
#define SPI_CS_DELAY_MODE_S  SPI_MEM_CS_DELAY_MODE_S
#define SPI_CS_HOLD_TIME  SPI_MEM_CS_HOLD_TIME
#define SPI_CS_HOLD_TIME_M  SPI_MEM_CS_HOLD_TIME_M
#define SPI_CS_HOLD_TIME_V  SPI_MEM_CS_HOLD_TIME_V
#define SPI_CS_HOLD_TIME_S  SPI_MEM_CS_HOLD_TIME_S
#define SPI_CS_SETUP_TIME  SPI_MEM_CS_SETUP_TIME
#define SPI_CS_SETUP_TIME_M  SPI_MEM_CS_SETUP_TIME_M
#define SPI_CS_SETUP_TIME_V  SPI_MEM_CS_SETUP_TIME_V
#define SPI_CS_SETUP_TIME_S  SPI_MEM_CS_SETUP_TIME_S

#define SPI_CLOCK_REG SPI_MEM_CLOCK_REG
#define SPI_CLK_EQU_SYSCLK SPI_MEM_CLK_EQU_SYSCLK
#define SPI_CLK_EQU_SYSCLK_M SPI_MEM_CLK_EQU_SYSCLK_M
#define SPI_CLK_EQU_SYSCLK_V  SPI_MEM_CLK_EQU_SYSCLK_V
#define SPI_CLK_EQU_SYSCLK_S  SPI_MEM_CLK_EQU_SYSCLK_S
#define SPI_CLKCNT_N SPI_MEM_CLKCNT_N
#define SPI_CLKCNT_N_M SPI_MEM_CLKCNT_N_M
#define SPI_CLKCNT_N_V SPI_MEM_CLKCNT_N_V
#define SPI_CLKCNT_N_S SPI_MEM_CLKCNT_N_S
#define SPI_CLKCNT_H SPI_MEM_CLKCNT_H
#define SPI_CLKCNT_H_M SPI_MEM_CLKCNT_H_M
#define SPI_CLKCNT_H_V SPI_MEM_CLKCNT_H_V
#define SPI_CLKCNT_H_S SPI_MEM_CLKCNT_H_S
#define SPI_CLKCNT_L SPI_MEM_CLKCNT_L
#define SPI_CLKCNT_L_M SPI_MEM_CLKCNT_L_M
#define SPI_CLKCNT_L_V SPI_MEM_CLKCNT_L_V
#define SPI_CLKCNT_L_S SPI_MEM_CLKCNT_L_S

#define SPI_USER_REG SPI_MEM_USER_REG
#define SPI_USR_COMMAND SPI_MEM_USR_COMMAND
#define SPI_USR_ADDR SPI_MEM_USR_ADDR
#define SPI_USR_DUMMY SPI_MEM_USR_DUMMY
#define SPI_USR_MISO SPI_MEM_USR_MISO
#define SPI_USR_MOSI SPI_MEM_USR_MOSI
#define SPI_USR_DUMMY_IDLE SPI_MEM_USR_DUMMY_IDLE
#define SPI_USR_MOSI_HIGHPART SPI_MEM_USR_MOSI_HIGHPART
#define SPI_USR_MISO_HIGHPART SPI_MEM_USR_MISO_HIGHPART
#define SPI_FWRITE_QIO SPI_MEM_FWRITE_QIO
#define SPI_FWRITE_DIO SPI_MEM_FWRITE_DIO
#define SPI_FWRITE_QUAD SPI_MEM_FWRITE_QUAD
#define SPI_FWRITE_DUAL SPI_MEM_FWRITE_DUAL
#define SPI_FWRITE_DUAL_M SPI_MEM_FWRITE_DUAL_M
#define SPI_FWRITE_DUAL_V SPI_MEM_FWRITE_DUAL_V
#define SPI_FWRITE_DUAL_S SPI_MEM_FWRITE_DUAL_S
#define SPI_CK_OUT_EDGE SPI_MEM_CK_OUT_EDGE
#define SPI_CK_I_EDGE SPI_MEM_CK_I_EDGE
#define SPI_CS_SETUP SPI_MEM_CS_SETUP
#define SPI_CS_SETUP_M SPI_MEM_CS_SETUP_M
#define SPI_CS_SETUP_V SPI_MEM_CS_SETUP_V
#define SPI_CS_SETUP_S SPI_MEM_CS_SETUP_S
#define SPI_CS_HOLD SPI_MEM_CS_HOLD

#define SPI_USER1_REG SPI_MEM_USER1_REG
#define SPI_USR_ADDR_BITLEN SPI_MEM_USR_ADDR_BITLEN
#define SPI_USR_ADDR_BITLEN_M SPI_MEM_USR_ADDR_BITLEN_M
#define SPI_USR_ADDR_BITLEN_V SPI_MEM_USR_ADDR_BITLEN_V
#define SPI_USR_ADDR_BITLEN_S SPI_MEM_USR_ADDR_BITLEN_S
#define SPI_USR_DUMMY_CYCLELEN SPI_MEM_USR_DUMMY_CYCLELEN
#define SPI_USR_DUMMY_CYCLELEN_M SPI_MEM_USR_DUMMY_CYCLELEN_M
#define SPI_USR_DUMMY_CYCLELEN_V SPI_MEM_USR_DUMMY_CYCLELEN_V
#define SPI_USR_DUMMY_CYCLELEN_S SPI_MEM_USR_DUMMY_CYCLELEN_S

#define SPI_USER2_REG SPI_MEM_USER2_REG
#define SPI_USR_COMMAND_BITLEN SPI_MEM_USR_COMMAND_BITLEN
#define SPI_USR_COMMAND_BITLEN_M SPI_MEM_USR_COMMAND_BITLEN_M
#define SPI_USR_COMMAND_BITLEN_V SPI_MEM_USR_COMMAND_BITLEN_V
#define SPI_USR_COMMAND_BITLEN_S SPI_MEM_USR_COMMAND_BITLEN_S
#define SPI_USR_COMMAND_VALUE SPI_MEM_USR_COMMAND_VALUE
#define SPI_USR_COMMAND_VALUE_M SPI_MEM_USR_COMMAND_VALUE_M
#define SPI_USR_COMMAND_VALUE_V SPI_MEM_USR_COMMAND_VALUE_V
#define SPI_USR_COMMAND_VALUE_S SPI_MEM_USR_COMMAND_VALUE_S

#define SPI_MOSI_DLEN_REG SPI_MEM_MOSI_DLEN_REG
#define SPI_USR_MOSI_DBITLEN  SPI_MEM_USR_MOSI_DBITLEN
#define SPI_USR_MOSI_DBITLEN_M SPI_MEM_USR_MOSI_DBITLEN_M
#define SPI_USR_MOSI_DBITLEN_V SPI_MEM_USR_MOSI_DBITLEN_V
#define SPI_USR_MOSI_DBITLEN_S SPI_MEM_USR_MOSI_DBITLEN_S

#define SPI_MISO_DLEN_REG SPI_MEM_MISO_DLEN_REG
#define SPI_USR_MISO_DBITLEN SPI_MEM_USR_MISO_DBITLEN
#define SPI_USR_MISO_DBITLEN_M SPI_MEM_USR_MISO_DBITLEN_M
#define SPI_USR_MISO_DBITLEN_V SPI_MEM_USR_MISO_DBITLEN_V
#define SPI_USR_MISO_DBITLEN_S SPI_MEM_USR_MISO_DBITLEN_S

#define SPI_SLAVE_REG SPI_MEM_MISC_REG
#define SPI_PIN_REG SPI_MEM_MISC_REG
#define SPI_CS_KEEP_ACTIVE SPI_MEM_CS_KEEP_ACTIVE
#define SPI_CK_IDLE_EDGE SPI_MEM_CK_IDLE_EDGE
#define SPI_SUB_PIN SPI_MEM_SUB_PIN
#define SPI_CS_POL SPI_MEM_CS_POL
#define SPI_CS_POL_M SPI_MEM_CS_POL_M
#define SPI_CS_POL_V SPI_MEM_CS_POL_V
#define SPI_CS_POL_S SPI_MEM_CS_POL_S
#define SPI_TRANS_END_INT_ENA SPI_MEM_TRANS_END_INT_ENA
#define SPI_TRANS_DONE SPI_MEM_TRANS_END
#define SPI_CS2_DIS SPI_MEM_CS2_DIS
#define SPI_CS2_DIS_M SPI_MEM_CS2_DIS_M
#define SPI_CS2_DIS_V SPI_MEM_CS2_DIS_V
#define SPI_CS2_DIS_S SPI_MEM_CS2_DIS_S
#define SPI_CS1_DIS SPI_MEM_CS1_DIS
#define SPI_CS1_DIS_M SPI_MEM_CS1_DIS_M
#define SPI_CS1_DIS_V SPI_MEM_CS1_DIS_V
#define SPI_CS1_DIS_S SPI_MEM_CS1_DIS_S
#define SPI_CS0_DIS SPI_MEM_CS0_DIS
#define SPI_CS0_DIS_M SPI_MEM_CS0_DIS_M
#define SPI_CS0_DIS_V SPI_MEM_CS0_DIS_V
#define SPI_CS0_DIS_S SPI_MEM_CS0_DIS_S

#define SPI_CACHE_SCTRL_REG SPI_MEM_CACHE_SCTRL_REG
#define SPI_SRAM_WDUMMY_CYCLELEN SPI_MEM_SRAM_WDUMMY_CYCLELEN 
#define SPI_SRAM_WDUMMY_CYCLELEN_M SPI_MEM_SRAM_WDUMMY_CYCLELEN_M
#define SPI_SRAM_WDUMMY_CYCLELEN_V SPI_MEM_SRAM_WDUMMY_CYCLELEN_V
#define SPI_SRAM_WDUMMY_CYCLELEN_S SPI_MEM_SRAM_WDUMMY_CYCLELEN_S
#define SPI_CACHE_SRAM_USR_WCMD SPI_MEM_CACHE_SRAM_USR_WCMD
#define SPI_CACHE_SRAM_USR_WCMD_M SPI_MEM_CACHE_SRAM_USR_WCMD_M
#define SPI_CACHE_SRAM_USR_WCMD_V SPI_MEM_CACHE_SRAM_USR_WCMD_V
#define SPI_CACHE_SRAM_USR_WCMD_S SPI_MEM_CACHE_SRAM_USR_WCMD_S
#define SPI_SRAM_ADDR_BITLEN SPI_MEM_SRAM_ADDR_BITLEN
#define SPI_SRAM_ADDR_BITLEN_M SPI_MEM_SRAM_ADDR_BITLEN_M
#define SPI_SRAM_ADDR_BITLEN_V SPI_MEM_SRAM_ADDR_BITLEN_V
#define SPI_SRAM_ADDR_BITLEN_S SPI_MEM_SRAM_ADDR_BITLEN_S
#define SPI_SRAM_RDUMMY_CYCLELEN SPI_MEM_SRAM_RDUMMY_CYCLELEN
#define SPI_SRAM_RDUMMY_CYCLELEN_M SPI_MEM_SRAM_RDUMMY_CYCLELEN_M
#define SPI_SRAM_RDUMMY_CYCLELEN_V SPI_MEM_SRAM_RDUMMY_CYCLELEN_V
#define SPI_SRAM_RDUMMY_CYCLELEN_S SPI_MEM_SRAM_RDUMMY_CYCLELEN_S
#define SPI_CACHE_SRAM_USR_RCMD SPI_MEM_CACHE_SRAM_USR_RCMD
#define SPI_CACHE_SRAM_USR_RCMD_M SPI_MEM_CACHE_SRAM_USR_RCMD_M
#define SPI_CACHE_SRAM_USR_RCMD_V SPI_MEM_CACHE_SRAM_USR_RCMD_V
#define SPI_CACHE_SRAM_USR_RCMD_S SPI_MEM_CACHE_SRAM_USR_RCMD_S
#define SPI_USR_RD_SRAM_DUMMY SPI_MEM_USR_RD_SRAM_DUMMY
#define SPI_USR_RD_SRAM_DUMMY_M SPI_MEM_USR_RD_SRAM_DUMMY_M
#define SPI_USR_RD_SRAM_DUMMY_V SPI_MEM_USR_RD_SRAM_DUMMY_V
#define SPI_USR_RD_SRAM_DUMMY_S SPI_MEM_USR_RD_SRAM_DUMMY_S
#define SPI_USR_WR_SRAM_DUMMY SPI_MEM_USR_WR_SRAM_DUMMY
#define SPI_USR_WR_SRAM_DUMMY_M SPI_MEM_USR_WR_SRAM_DUMMY_M
#define SPI_USR_WR_SRAM_DUMMY_V SPI_MEM_USR_WR_SRAM_DUMMY_V
#define SPI_USR_WR_SRAM_DUMMY_S SPI_MEM_USR_WR_SRAM_DUMMY_S
#define SPI_USR_SRAM_QIO SPI_MEM_USR_SRAM_QIO
#define SPI_USR_SRAM_QIO_M SPI_MEM_USR_SRAM_QIO_M
#define SPI_USR_SRAM_QIO_V SPI_MEM_USR_SRAM_QIO_V
#define SPI_USR_SRAM_QIO_S SPI_MEM_USR_SRAM_QIO_S
#define SPI_USR_SRAM_DIO SPI_MEM_USR_SRAM_DIO
#define SPI_USR_SRAM_DIO_M SPI_MEM_USR_SRAM_DIO_M
#define SPI_USR_SRAM_DIO_V SPI_MEM_USR_SRAM_DIO_V
#define SPI_USR_SRAM_DIO_S SPI_MEM_USR_SRAM_DIO_S
#define SPI_CACHE_USR_SCMD_4BYTE SPI_MEM_CACHE_USR_SCMD_4BYTE
#define SPI_CACHE_USR_SCMD_4BYTE_M SPI_MEM_CACHE_USR_SCMD_4BYTE_M
#define SPI_CACHE_USR_SCMD_4BYTE_V SPI_MEM_CACHE_USR_SCMD_4BYTE_V
#define SPI_CACHE_USR_SCMD_4BYTE_S SPI_MEM_CACHE_USR_SCMD_4BYTE_S

#define SPI_SRAM_DRD_CMD_REG SPI_MEM_SRAM_DRD_CMD_REG
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_M SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_M
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_V SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_V
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_S SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_S
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_M SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_M
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_V SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_V
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_S SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_S

#define SPI_SRAM_DWR_CMD_REG SPI_MEM_SRAM_DWR_CMD_REG
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_M SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_M
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_V SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_V
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_S SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_S
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_M SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_M
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_V SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_V
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_S SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_S

#define SPI_SRAM_CLK_REG SPI_MEM_SRAM_CLK_REG
#define SPI_SCLK_EQU_SYSCLK SPI_MEM_SCLK_EQU_SYSCLK
#define SPI_SCLKCNT_N SPI_MEM_SCLKCNT_N
#define SPI_SCLKCNT_N_M SPI_MEM_SCLKCNT_N_M
#define SPI_SCLKCNT_N_V SPI_MEM_SCLKCNT_N_V
#define SPI_SCLKCNT_N_S SPI_MEM_SCLKCNT_N_S
#define SPI_SCLKCNT_H SPI_MEM_SCLKCNT_H
#define SPI_SCLKCNT_H_M SPI_MEM_SCLKCNT_H_M
#define SPI_SCLKCNT_H_V SPI_MEM_SCLKCNT_H_V
#define SPI_SCLKCNT_H_S SPI_MEM_SCLKCNT_H_S
#define SPI_SCLKCNT_L  SPI_MEM_SCLKCNT_L
#define SPI_SCLKCNT_L_M SPI_MEM_SCLKCNT_L_M
#define SPI_SCLKCNT_L_V SPI_MEM_SCLKCNT_L_V
#define SPI_SCLKCNT_L_S SPI_MEM_SCLKCNT_L_S

#define SPI_EXT2_REG SPI_MEM_FSM_REG
#define SPI_ST SPI_MEM_ST
#define SPI_ST_M SPI_MEM_ST_M
#define SPI_ST_V SPI_MEM_ST_V
#define SPI_ST_S SPI_MEM_ST_S

#define SPI_EXT3_REG SPI_MEM_HOLD_REG
#define SPI_HOLD_ENA SPI_MEM_HOLD_ENA
#define SPI_HOLD_ENA_M SPI_MEM_HOLD_ENA_M
#define SPI_HOLD_ENA_V SPI_MEM_HOLD_ENA_V
#define SPI_HOLD_ENA_S SPI_MEM_HOLD_ENA_S

#define SPI_W0_REG SPI_MEM_W0_REG
#define SPI_W1_REG SPI_MEM_W1_REG
#define SPI_W2_REG SPI_MEM_W2_REG
#define SPI_W3_REG SPI_MEM_W3_REG
#define SPI_W4_REG SPI_MEM_W4_REG
#define SPI_W5_REG SPI_MEM_W5_REG
#define SPI_W6_REG SPI_MEM_W6_REG
#define SPI_W7_REG SPI_MEM_W7_REG
#define SPI_W8_REG SPI_MEM_W8_REG
#define SPI_W9_REG SPI_MEM_W9_REG
#define SPI_W10_REG SPI_MEM_W10_REG
#define SPI_W11_REG SPI_MEM_W11_REG
#define SPI_W12_REG SPI_MEM_W12_REG
#define SPI_W13_REG SPI_MEM_W13_REG
#define SPI_W14_REG SPI_MEM_W14_REG
#define SPI_W15_REG SPI_MEM_W15_REG

#define SPI_MEM_CMD_REG(i)          (REG_SPI_BASE(i) + 0x000)
/* SPI_MEM_FLASH_READ : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: Read flash enable. Read flash operation will be triggered when
 the bit is set. The bit will be cleared once the operation done. 1: enable 0: disable.*/
#define SPI_MEM_FLASH_READ  (BIT(31))
#define SPI_MEM_FLASH_READ_M  (BIT(31))
#define SPI_MEM_FLASH_READ_V  0x1
#define SPI_MEM_FLASH_READ_S  31
/* SPI_MEM_FLASH_WREN : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Write flash enable.  Write enable command will be sent when the
 bit is set. The bit will be cleared once the operation done. 1: enable 0: disable.*/
#define SPI_MEM_FLASH_WREN  (BIT(30))
#define SPI_MEM_FLASH_WREN_M  (BIT(30))
#define SPI_MEM_FLASH_WREN_V  0x1
#define SPI_MEM_FLASH_WREN_S  30
/* SPI_MEM_FLASH_WRDI : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Write flash disable. Write disable command will be sent when
 the bit is set. The bit will be cleared once the operation done. 1: enable 0: disable.*/
#define SPI_MEM_FLASH_WRDI  (BIT(29))
#define SPI_MEM_FLASH_WRDI_M  (BIT(29))
#define SPI_MEM_FLASH_WRDI_V  0x1
#define SPI_MEM_FLASH_WRDI_S  29
/* SPI_MEM_FLASH_RDID : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Read JEDEC ID . Read ID command will be sent when the bit is
 set. The bit will be cleared once the operation done. 1: enable 0: disable.*/
#define SPI_MEM_FLASH_RDID  (BIT(28))
#define SPI_MEM_FLASH_RDID_M  (BIT(28))
#define SPI_MEM_FLASH_RDID_V  0x1
#define SPI_MEM_FLASH_RDID_S  28
/* SPI_MEM_FLASH_RDSR : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: Read status register-1.  Read status operation will be triggered
 when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_RDSR  (BIT(27))
#define SPI_MEM_FLASH_RDSR_M  (BIT(27))
#define SPI_MEM_FLASH_RDSR_V  0x1
#define SPI_MEM_FLASH_RDSR_S  27
/* SPI_MEM_FLASH_WRSR : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Write status register enable.   Write status operation  will
 be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_WRSR  (BIT(26))
#define SPI_MEM_FLASH_WRSR_M  (BIT(26))
#define SPI_MEM_FLASH_WRSR_V  0x1
#define SPI_MEM_FLASH_WRSR_S  26
/* SPI_MEM_FLASH_PP : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: Page program enable(1 byte ~256 bytes data to be programmed).
 Page program operation  will be triggered when the bit is set. The bit will be cleared once the operation done .1: enable 0: disable.*/
#define SPI_MEM_FLASH_PP  (BIT(25))
#define SPI_MEM_FLASH_PP_M  (BIT(25))
#define SPI_MEM_FLASH_PP_V  0x1
#define SPI_MEM_FLASH_PP_S  25
/* SPI_MEM_FLASH_SE : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: Sector erase enable(4KB). Sector erase operation will be triggered
 when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_SE  (BIT(24))
#define SPI_MEM_FLASH_SE_M  (BIT(24))
#define SPI_MEM_FLASH_SE_V  0x1
#define SPI_MEM_FLASH_SE_S  24
/* SPI_MEM_FLASH_BE : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: Block erase enable(32KB) .  Block erase operation will be triggered
 when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_BE  (BIT(23))
#define SPI_MEM_FLASH_BE_M  (BIT(23))
#define SPI_MEM_FLASH_BE_V  0x1
#define SPI_MEM_FLASH_BE_S  23
/* SPI_MEM_FLASH_CE : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Chip erase enable. Chip erase operation will be triggered when
 the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_CE  (BIT(22))
#define SPI_MEM_FLASH_CE_M  (BIT(22))
#define SPI_MEM_FLASH_CE_V  0x1
#define SPI_MEM_FLASH_CE_S  22
/* SPI_MEM_FLASH_DP : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Drive Flash into power down.  An operation will be triggered
 when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_DP  (BIT(21))
#define SPI_MEM_FLASH_DP_M  (BIT(21))
#define SPI_MEM_FLASH_DP_V  0x1
#define SPI_MEM_FLASH_DP_S  21
/* SPI_MEM_FLASH_RES : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: This bit combined with reg_resandres bit releases Flash from
 the power-down state or high performance mode and obtains the devices ID. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_RES  (BIT(20))
#define SPI_MEM_FLASH_RES_M  (BIT(20))
#define SPI_MEM_FLASH_RES_V  0x1
#define SPI_MEM_FLASH_RES_S  20
/* SPI_MEM_FLASH_HPM : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: Drive Flash into high performance mode.  The bit will be cleared
 once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_HPM  (BIT(19))
#define SPI_MEM_FLASH_HPM_M  (BIT(19))
#define SPI_MEM_FLASH_HPM_V  0x1
#define SPI_MEM_FLASH_HPM_S  19
/* SPI_MEM_USR : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: User define command enable.  An operation will be triggered when
 the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_USR  (BIT(18))
#define SPI_MEM_USR_M  (BIT(18))
#define SPI_MEM_USR_V  0x1
#define SPI_MEM_USR_S  18
/* SPI_MEM_FLASH_PE : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: In user mode  it is set to indicate that program/erase operation
 will be triggered. The bit is combined with spi_mem_usr bit. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_PE  (BIT(17))
#define SPI_MEM_FLASH_PE_M  (BIT(17))
#define SPI_MEM_FLASH_PE_V  0x1
#define SPI_MEM_FLASH_PE_S  17

#define SPI_MEM_ADDR_REG(i)          (REG_SPI_BASE(i) + 0x004)
/* SPI_MEM_USR_ADDR_VALUE : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: In user mode  it is the memory address. other then the bit0-bit23
 is the memory address  the bit24-bit31 are the byte length of a transfer.*/
#define SPI_MEM_USR_ADDR_VALUE  0xFFFFFFFF
#define SPI_MEM_USR_ADDR_VALUE_M  ((SPI_MEM_USR_ADDR_VALUE_V)<<(SPI_MEM_USR_ADDR_VALUE_S))
#define SPI_MEM_USR_ADDR_VALUE_V  0xFFFFFFFF
#define SPI_MEM_USR_ADDR_VALUE_S  0

