foxval/esp-idf/components/soc/esp32c/include/soc/spi_mem_reg.h
#define SPI_MEM_SRAM_DRD_CMD_REG(i)          (REG_SPI_BASE(i) + 0x048)
/* SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0 When cache mode is enable it is the length in bits of
 command phase for sram. The register value shall be (bit_num-1).*/
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN  0x0000000F
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_M  ((SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_V)<<(SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_S))
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_V  0xF
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_S  28
/* SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0 When cache mode is enable it is the read command value
 of command phase for sram.*/
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE  0x0000FFFF
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_M  ((SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_V)<<(SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_S))
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_V  0xFFFF
#define SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_S  0

#define SPI_MEM_SRAM_DWR_CMD_REG(i)          (REG_SPI_BASE(i) + 0x04C)
/* SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0 When cache mode is enable it is the in bits of command
 phase  for sram. The register value shall be (bit_num-1).*/
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN  0x0000000F
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_M  ((SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_V)<<(SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_S))
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_V  0xF
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_S  28
/* SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0 When cache mode is enable it is the write command value
 of command phase for sram.*/
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE  0x0000FFFF
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_M  ((SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_V)<<(SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_S))
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_V  0xFFFF
#define SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_S  0

#define SPI_MEM_SRAM_CLK_REG(i)          (REG_SPI_BASE(i) + 0x050)
/* SPI_MEM_SCLK_EQU_SYSCLK : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: For SPI0 sram interface  1: spi_mem_clk is eqaul to system 0:
 spi_mem_clk is divided from system clock.*/
#define SPI_MEM_SCLK_EQU_SYSCLK  (BIT(31))
#define SPI_MEM_SCLK_EQU_SYSCLK_M  (BIT(31))
#define SPI_MEM_SCLK_EQU_SYSCLK_V  0x1
#define SPI_MEM_SCLK_EQU_SYSCLK_S  31
/* SPI_MEM_SCLKCNT_N : R/W ;bitpos:[23:16] ;default: 8'h3 ; */
/*description: For SPI0 sram interface  it is the divider of spi_mem_clk. So
 spi_mem_clk frequency is system/(spi_mem_clkcnt_N+1)*/
#define SPI_MEM_SCLKCNT_N  0x000000FF
#define SPI_MEM_SCLKCNT_N_M  ((SPI_MEM_SCLKCNT_N_V)<<(SPI_MEM_SCLKCNT_N_S))
#define SPI_MEM_SCLKCNT_N_V  0xFF
#define SPI_MEM_SCLKCNT_N_S  16
/* SPI_MEM_SCLKCNT_H : R/W ;bitpos:[15:8] ;default: 8'h1 ; */
/*description: For SPI0 sram interface  it must be floor((spi_mem_clkcnt_N+1)/2-1).
 In the slave mode it must be 0.*/
#define SPI_MEM_SCLKCNT_H  0x000000FF
#define SPI_MEM_SCLKCNT_H_M  ((SPI_MEM_SCLKCNT_H_V)<<(SPI_MEM_SCLKCNT_H_S))
#define SPI_MEM_SCLKCNT_H_V  0xFF
#define SPI_MEM_SCLKCNT_H_S  8
/* SPI_MEM_SCLKCNT_L : R/W ;bitpos:[7:0] ;default: 8'h3 ; */
/*description: For SPI0 sram interface  it must be equal to spi_mem_clkcnt_N.
 In the slave mode it must be 0.*/
#define SPI_MEM_SCLKCNT_L  0x000000FF
#define SPI_MEM_SCLKCNT_L_M  ((SPI_MEM_SCLKCNT_L_V)<<(SPI_MEM_SCLKCNT_L_S))
#define SPI_MEM_SCLKCNT_L_V  0xFF
#define SPI_MEM_SCLKCNT_L_S  0

#define SPI_MEM_FSM_REG(i)          (REG_SPI_BASE(i) + 0x054)
/* SPI_MEM_ST : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: The status of spi state machine. 0: idle state  1: preparation
 state  2: send command state  3: send data state  4: red data state  5:write data state  6: wait state  7: done state.*/
#define SPI_MEM_ST  0x00000007
#define SPI_MEM_ST_M  ((SPI_MEM_ST_V)<<(SPI_MEM_ST_S))
#define SPI_MEM_ST_V  0x7
#define SPI_MEM_ST_S  0

#define SPI_MEM_HOLD_REG(i)          (REG_SPI_BASE(i) + 0x058)
/* SPI_MEM_HOLD_ENA : R/W ;bitpos:[1:0] ;default: 2'd3 ; */
/*description: This register is for two SPI masters to share the same cs clock
 and data signals. The bits of one SPI are set  if the other SPI is busy  the SPI will be hold. 1(3): hold at  idle  phase 2: hold at  prepare  phase.*/
#define SPI_MEM_HOLD_ENA  0x00000003
#define SPI_MEM_HOLD_ENA_M  ((SPI_MEM_HOLD_ENA_V)<<(SPI_MEM_HOLD_ENA_S))
#define SPI_MEM_HOLD_ENA_V  0x3
#define SPI_MEM_HOLD_ENA_S  0

#define SPI_MEM_DMA_CONF_REG(i)          (REG_SPI_BASE(i) + 0x05C)
/* SPI_MEM_DMA_CONTINUE : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: spi dma continue tx/rx data.*/
#define SPI_MEM_DMA_CONTINUE  (BIT(16))
#define SPI_MEM_DMA_CONTINUE_M  (BIT(16))
#define SPI_MEM_DMA_CONTINUE_V  0x1
#define SPI_MEM_DMA_CONTINUE_S  16
/* SPI_MEM_DMA_TX_STOP : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: spi dma write data stop when in continue tx/rx mode.*/
#define SPI_MEM_DMA_TX_STOP  (BIT(15))
#define SPI_MEM_DMA_TX_STOP_M  (BIT(15))
#define SPI_MEM_DMA_TX_STOP_V  0x1
#define SPI_MEM_DMA_TX_STOP_S  15
/* SPI_MEM_DMA_RX_STOP : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: spi dma read data stop  when in continue tx/rx mode.*/
#define SPI_MEM_DMA_RX_STOP  (BIT(14))
#define SPI_MEM_DMA_RX_STOP_M  (BIT(14))
#define SPI_MEM_DMA_RX_STOP_V  0x1
#define SPI_MEM_DMA_RX_STOP_S  14
/* SPI_MEM_DMA_MEM_TRANS_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: reserved*/
#define SPI_MEM_DMA_MEM_TRANS_ENA  (BIT(13))
#define SPI_MEM_DMA_MEM_TRANS_ENA_M  (BIT(13))
#define SPI_MEM_DMA_MEM_TRANS_ENA_V  0x1
#define SPI_MEM_DMA_MEM_TRANS_ENA_S  13
/* SPI_MEM_OUT_DATA_BURST_EN : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: spi dma read data from memory in burst mode.*/
#define SPI_MEM_OUT_DATA_BURST_EN  (BIT(12))
#define SPI_MEM_OUT_DATA_BURST_EN_M  (BIT(12))
#define SPI_MEM_OUT_DATA_BURST_EN_V  0x1
#define SPI_MEM_OUT_DATA_BURST_EN_S  12
/* SPI_MEM_INDSCR_BURST_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: read descriptor use burst mode when write data to memory.*/
#define SPI_MEM_INDSCR_BURST_EN  (BIT(11))
#define SPI_MEM_INDSCR_BURST_EN_M  (BIT(11))
#define SPI_MEM_INDSCR_BURST_EN_V  0x1
#define SPI_MEM_INDSCR_BURST_EN_S  11
/* SPI_MEM_OUTDSCR_BURST_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: read descriptor use burst mode when read data for memory.*/
#define SPI_MEM_OUTDSCR_BURST_EN  (BIT(10))
#define SPI_MEM_OUTDSCR_BURST_EN_M  (BIT(10))
#define SPI_MEM_OUTDSCR_BURST_EN_V  0x1
#define SPI_MEM_OUTDSCR_BURST_EN_S  10
/* SPI_MEM_OUT_EOF_MODE : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: out eof flag generation mode . 1: when dma pop all data from
 fifo  0:when ahb push all data to fifo.*/
#define SPI_MEM_OUT_EOF_MODE  (BIT(9))
#define SPI_MEM_OUT_EOF_MODE_M  (BIT(9))
#define SPI_MEM_OUT_EOF_MODE_V  0x1
#define SPI_MEM_OUT_EOF_MODE_S  9
/* SPI_MEM_OUT_AUTO_WRBACK : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: when the bit is set  DMA continue to use the next inlink node
 when the length of inlink is 0.*/
#define SPI_MEM_OUT_AUTO_WRBACK  (BIT(8))
#define SPI_MEM_OUT_AUTO_WRBACK_M  (BIT(8))
#define SPI_MEM_OUT_AUTO_WRBACK_V  0x1
#define SPI_MEM_OUT_AUTO_WRBACK_S  8
/* SPI_MEM_OUT_LOOP_TEST : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set bit to test out link.*/
#define SPI_MEM_OUT_LOOP_TEST  (BIT(7))
#define SPI_MEM_OUT_LOOP_TEST_M  (BIT(7))
#define SPI_MEM_OUT_LOOP_TEST_V  0x1
#define SPI_MEM_OUT_LOOP_TEST_S  7
/* SPI_MEM_IN_LOOP_TEST : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set bit to test in link.*/
#define SPI_MEM_IN_LOOP_TEST  (BIT(6))
#define SPI_MEM_IN_LOOP_TEST_M  (BIT(6))
#define SPI_MEM_IN_LOOP_TEST_V  0x1
#define SPI_MEM_IN_LOOP_TEST_S  6
/* SPI_MEM_AHBM_RST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Reset spi dma ahb master.*/
#define SPI_MEM_AHBM_RST  (BIT(5))
#define SPI_MEM_AHBM_RST_M  (BIT(5))
#define SPI_MEM_AHBM_RST_V  0x1
#define SPI_MEM_AHBM_RST_S  5
/* SPI_MEM_AHBM_FIFO_RST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Reset spi dma ahb master fifo pointer.*/
#define SPI_MEM_AHBM_FIFO_RST  (BIT(4))
#define SPI_MEM_AHBM_FIFO_RST_M  (BIT(4))
#define SPI_MEM_AHBM_FIFO_RST_V  0x1
#define SPI_MEM_AHBM_FIFO_RST_S  4
/* SPI_MEM_OUT_RST : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to reset out dma fsm and out data fifo pointer.*/
#define SPI_MEM_OUT_RST  (BIT(3))
#define SPI_MEM_OUT_RST_M  (BIT(3))
#define SPI_MEM_OUT_RST_V  0x1
#define SPI_MEM_OUT_RST_S  3
/* SPI_MEM_IN_RST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to reset in dma fsm and in data fifo pointer.*/
#define SPI_MEM_IN_RST  (BIT(2))
#define SPI_MEM_IN_RST_M  (BIT(2))
#define SPI_MEM_IN_RST_V  0x1
#define SPI_MEM_IN_RST_S  2
/* SPI_MEM_DMA_TX_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: spi dma tx data enable.*/
#define SPI_MEM_DMA_TX_ENA  (BIT(1))
#define SPI_MEM_DMA_TX_ENA_M  (BIT(1))
#define SPI_MEM_DMA_TX_ENA_V  0x1
#define SPI_MEM_DMA_TX_ENA_S  1
/* SPI_MEM_DMA_RX_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: spi dma rx data enable.*/
#define SPI_MEM_DMA_RX_ENA  (BIT(0))
#define SPI_MEM_DMA_RX_ENA_M  (BIT(0))
#define SPI_MEM_DMA_RX_ENA_V  0x1
#define SPI_MEM_DMA_RX_ENA_S  0

#define SPI_MEM_DMA_OUT_LINK_REG(i)          (REG_SPI_BASE(i) + 0x060)
/* SPI_MEM_OUTLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set the bit to mount on new outlink descriptors.*/
#define SPI_MEM_OUTLINK_RESTART  (BIT(30))
#define SPI_MEM_OUTLINK_RESTART_M  (BIT(30))
#define SPI_MEM_OUTLINK_RESTART_V  0x1
#define SPI_MEM_OUTLINK_RESTART_S  30
/* SPI_MEM_OUTLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set the bit to start to use outlink descriptor.*/
#define SPI_MEM_OUTLINK_START  (BIT(29))
#define SPI_MEM_OUTLINK_START_M  (BIT(29))
#define SPI_MEM_OUTLINK_START_V  0x1
#define SPI_MEM_OUTLINK_START_S  29
/* SPI_MEM_OUTLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set the bit to stop to use outlink descriptor.*/
#define SPI_MEM_OUTLINK_STOP  (BIT(28))
#define SPI_MEM_OUTLINK_STOP_M  (BIT(28))
#define SPI_MEM_OUTLINK_STOP_V  0x1
#define SPI_MEM_OUTLINK_STOP_S  28
/* SPI_MEM_OUTLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The address of the first outlink descriptor.*/
#define SPI_MEM_OUTLINK_ADDR  0x000FFFFF
#define SPI_MEM_OUTLINK_ADDR_M  ((SPI_MEM_OUTLINK_ADDR_V)<<(SPI_MEM_OUTLINK_ADDR_S))
#define SPI_MEM_OUTLINK_ADDR_V  0xFFFFF
#define SPI_MEM_OUTLINK_ADDR_S  0

