foxval/esp-idf/components/soc/esp32c/include/soc/spi_mem_reg.h
#define SPI_MEM_DMA_IN_LINK_REG(i)          (REG_SPI_BASE(i) + 0x064)
/* SPI_MEM_INLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set the bit to mount on new inlink descriptors.*/
#define SPI_MEM_INLINK_RESTART  (BIT(30))
#define SPI_MEM_INLINK_RESTART_M  (BIT(30))
#define SPI_MEM_INLINK_RESTART_V  0x1
#define SPI_MEM_INLINK_RESTART_S  30
/* SPI_MEM_INLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set the bit to start to use inlink descriptor.*/
#define SPI_MEM_INLINK_START  (BIT(29))
#define SPI_MEM_INLINK_START_M  (BIT(29))
#define SPI_MEM_INLINK_START_V  0x1
#define SPI_MEM_INLINK_START_S  29
/* SPI_MEM_INLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set the bit to stop to use inlink descriptor.*/
#define SPI_MEM_INLINK_STOP  (BIT(28))
#define SPI_MEM_INLINK_STOP_M  (BIT(28))
#define SPI_MEM_INLINK_STOP_V  0x1
#define SPI_MEM_INLINK_STOP_S  28
/* SPI_MEM_INLINK_AUTO_RET : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: when the bit is set  the inlink descriptor returns to the first
 link node when a packet is error.*/
#define SPI_MEM_INLINK_AUTO_RET  (BIT(20))
#define SPI_MEM_INLINK_AUTO_RET_M  (BIT(20))
#define SPI_MEM_INLINK_AUTO_RET_V  0x1
#define SPI_MEM_INLINK_AUTO_RET_S  20
/* SPI_MEM_INLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The address of the first inlink descriptor.*/
#define SPI_MEM_INLINK_ADDR  0x000FFFFF
#define SPI_MEM_INLINK_ADDR_M  ((SPI_MEM_INLINK_ADDR_V)<<(SPI_MEM_INLINK_ADDR_S))
#define SPI_MEM_INLINK_ADDR_V  0xFFFFF
#define SPI_MEM_INLINK_ADDR_S  0

#define SPI_MEM_DMA_INT_ENA_REG(i)          (REG_SPI_BASE(i) + 0x068)
/* SPI_MEM_OUT_TOTAL_EOF_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The enable bit for sending all the packets to host done.*/
#define SPI_MEM_OUT_TOTAL_EOF_INT_ENA  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_ENA_M  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_ENA_V  0x1
#define SPI_MEM_OUT_TOTAL_EOF_INT_ENA_S  8
/* SPI_MEM_OUT_EOF_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The enable bit for sending a packet to host done.*/
#define SPI_MEM_OUT_EOF_INT_ENA  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_ENA_M  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_ENA_V  0x1
#define SPI_MEM_OUT_EOF_INT_ENA_S  7
/* SPI_MEM_OUT_DONE_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The enable bit for completing usage of a outlink descriptor .*/
#define SPI_MEM_OUT_DONE_INT_ENA  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_ENA_M  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_ENA_V  0x1
#define SPI_MEM_OUT_DONE_INT_ENA_S  6
/* SPI_MEM_IN_SUC_EOF_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The enable bit for completing receiving all the packets from host.*/
#define SPI_MEM_IN_SUC_EOF_INT_ENA  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_ENA_M  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_ENA_V  0x1
#define SPI_MEM_IN_SUC_EOF_INT_ENA_S  5
/* SPI_MEM_IN_ERR_EOF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The enable bit for receiving error.*/
#define SPI_MEM_IN_ERR_EOF_INT_ENA  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_ENA_M  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_ENA_V  0x1
#define SPI_MEM_IN_ERR_EOF_INT_ENA_S  4
/* SPI_MEM_IN_DONE_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The enable bit for completing usage of a inlink descriptor.*/
#define SPI_MEM_IN_DONE_INT_ENA  (BIT(3))
#define SPI_MEM_IN_DONE_INT_ENA_M  (BIT(3))
#define SPI_MEM_IN_DONE_INT_ENA_V  0x1
#define SPI_MEM_IN_DONE_INT_ENA_S  3
/* SPI_MEM_INLINK_DSCR_ERROR_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The enable bit for inlink descriptor error.*/
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ENA  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ENA_M  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ENA_V  0x1
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ENA_S  2
/* SPI_MEM_OUTLINK_DSCR_ERROR_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The enable bit for outlink descriptor error.*/
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ENA  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ENA_M  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ENA_V  0x1
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ENA_S  1
/* SPI_MEM_INLINK_DSCR_EMPTY_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The enable bit for lack of enough inlink descriptors.*/
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ENA  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ENA_M  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ENA_V  0x1
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ENA_S  0

#define SPI_MEM_DMA_INT_RAW_REG(i)          (REG_SPI_BASE(i) + 0x06C)
/* SPI_MEM_OUT_TOTAL_EOF_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw bit for sending all the packets to host done.*/
#define SPI_MEM_OUT_TOTAL_EOF_INT_RAW  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_RAW_M  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_RAW_V  0x1
#define SPI_MEM_OUT_TOTAL_EOF_INT_RAW_S  8
/* SPI_MEM_OUT_EOF_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw bit for sending a packet to host done.*/
#define SPI_MEM_OUT_EOF_INT_RAW  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_RAW_M  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_RAW_V  0x1
#define SPI_MEM_OUT_EOF_INT_RAW_S  7
/* SPI_MEM_OUT_DONE_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw bit for completing usage of a outlink descriptor.*/
#define SPI_MEM_OUT_DONE_INT_RAW  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_RAW_M  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_RAW_V  0x1
#define SPI_MEM_OUT_DONE_INT_RAW_S  6
/* SPI_MEM_IN_SUC_EOF_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw bit for completing receiving all the packets from host.*/
#define SPI_MEM_IN_SUC_EOF_INT_RAW  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_RAW_M  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_RAW_V  0x1
#define SPI_MEM_IN_SUC_EOF_INT_RAW_S  5
/* SPI_MEM_IN_ERR_EOF_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit for receiving error.*/
#define SPI_MEM_IN_ERR_EOF_INT_RAW  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_RAW_M  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_RAW_V  0x1
#define SPI_MEM_IN_ERR_EOF_INT_RAW_S  4
/* SPI_MEM_IN_DONE_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw bit for completing usage of a inlink descriptor.*/
#define SPI_MEM_IN_DONE_INT_RAW  (BIT(3))
#define SPI_MEM_IN_DONE_INT_RAW_M  (BIT(3))
#define SPI_MEM_IN_DONE_INT_RAW_V  0x1
#define SPI_MEM_IN_DONE_INT_RAW_S  3
/* SPI_MEM_INLINK_DSCR_ERROR_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw bit for inlink descriptor error.*/
#define SPI_MEM_INLINK_DSCR_ERROR_INT_RAW  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_RAW_M  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_RAW_V  0x1
#define SPI_MEM_INLINK_DSCR_ERROR_INT_RAW_S  2
/* SPI_MEM_OUTLINK_DSCR_ERROR_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw bit for outlink descriptor error.*/
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_RAW  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_RAW_M  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_RAW_V  0x1
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_RAW_S  1
/* SPI_MEM_INLINK_DSCR_EMPTY_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw bit for lack of enough inlink descriptors.*/
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_RAW  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_RAW_M  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_RAW_V  0x1
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_RAW_S  0

#define SPI_MEM_DMA_INT_ST_REG(i)          (REG_SPI_BASE(i) + 0x070)
/* SPI_MEM_OUT_TOTAL_EOF_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The status bit for sending all the packets to host done.*/
#define SPI_MEM_OUT_TOTAL_EOF_INT_ST  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_ST_M  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_ST_V  0x1
#define SPI_MEM_OUT_TOTAL_EOF_INT_ST_S  8
/* SPI_MEM_OUT_EOF_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The status bit for sending a packet to host done.*/
#define SPI_MEM_OUT_EOF_INT_ST  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_ST_M  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_ST_V  0x1
#define SPI_MEM_OUT_EOF_INT_ST_S  7
/* SPI_MEM_OUT_DONE_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The status bit for completing usage of a outlink descriptor.*/
#define SPI_MEM_OUT_DONE_INT_ST  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_ST_M  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_ST_V  0x1
#define SPI_MEM_OUT_DONE_INT_ST_S  6
/* SPI_MEM_IN_SUC_EOF_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The status bit for completing receiving all the packets from host.*/
#define SPI_MEM_IN_SUC_EOF_INT_ST  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_ST_M  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_ST_V  0x1
#define SPI_MEM_IN_SUC_EOF_INT_ST_S  5
/* SPI_MEM_IN_ERR_EOF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The status bit for receiving error.*/
#define SPI_MEM_IN_ERR_EOF_INT_ST  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_ST_M  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_ST_V  0x1
#define SPI_MEM_IN_ERR_EOF_INT_ST_S  4
/* SPI_MEM_IN_DONE_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The status bit for completing usage of a inlink descriptor.*/
#define SPI_MEM_IN_DONE_INT_ST  (BIT(3))
#define SPI_MEM_IN_DONE_INT_ST_M  (BIT(3))
#define SPI_MEM_IN_DONE_INT_ST_V  0x1
#define SPI_MEM_IN_DONE_INT_ST_S  3
/* SPI_MEM_INLINK_DSCR_ERROR_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The status bit for inlink descriptor error.*/
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ST  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ST_M  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ST_V  0x1
#define SPI_MEM_INLINK_DSCR_ERROR_INT_ST_S  2
/* SPI_MEM_OUTLINK_DSCR_ERROR_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The status bit for outlink descriptor error.*/
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ST  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ST_M  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ST_V  0x1
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_ST_S  1
/* SPI_MEM_INLINK_DSCR_EMPTY_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The status bit for lack of enough inlink descriptors.*/
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ST  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ST_M  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ST_V  0x1
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_ST_S  0

#define SPI_MEM_DMA_INT_CLR_REG(i)          (REG_SPI_BASE(i) + 0x074)
/* SPI_MEM_OUT_TOTAL_EOF_INT_CLR : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The clear bit for sending all the packets to host done.*/
#define SPI_MEM_OUT_TOTAL_EOF_INT_CLR  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_CLR_M  (BIT(8))
#define SPI_MEM_OUT_TOTAL_EOF_INT_CLR_V  0x1
#define SPI_MEM_OUT_TOTAL_EOF_INT_CLR_S  8
/* SPI_MEM_OUT_EOF_INT_CLR : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The clear bit for sending a packet to host done.*/
#define SPI_MEM_OUT_EOF_INT_CLR  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_CLR_M  (BIT(7))
#define SPI_MEM_OUT_EOF_INT_CLR_V  0x1
#define SPI_MEM_OUT_EOF_INT_CLR_S  7
/* SPI_MEM_OUT_DONE_INT_CLR : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The clear bit for completing usage of a outlink descriptor.*/
#define SPI_MEM_OUT_DONE_INT_CLR  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_CLR_M  (BIT(6))
#define SPI_MEM_OUT_DONE_INT_CLR_V  0x1
#define SPI_MEM_OUT_DONE_INT_CLR_S  6
/* SPI_MEM_IN_SUC_EOF_INT_CLR : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The clear bit for completing receiving all the packets from host.*/
#define SPI_MEM_IN_SUC_EOF_INT_CLR  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_CLR_M  (BIT(5))
#define SPI_MEM_IN_SUC_EOF_INT_CLR_V  0x1
#define SPI_MEM_IN_SUC_EOF_INT_CLR_S  5
/* SPI_MEM_IN_ERR_EOF_INT_CLR : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The clear bit for receiving error.*/
#define SPI_MEM_IN_ERR_EOF_INT_CLR  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_CLR_M  (BIT(4))
#define SPI_MEM_IN_ERR_EOF_INT_CLR_V  0x1
#define SPI_MEM_IN_ERR_EOF_INT_CLR_S  4
/* SPI_MEM_IN_DONE_INT_CLR : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The clear bit for completing usage of a inlink descriptor.*/
#define SPI_MEM_IN_DONE_INT_CLR  (BIT(3))
#define SPI_MEM_IN_DONE_INT_CLR_M  (BIT(3))
#define SPI_MEM_IN_DONE_INT_CLR_V  0x1
#define SPI_MEM_IN_DONE_INT_CLR_S  3
/* SPI_MEM_INLINK_DSCR_ERROR_INT_CLR : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The clear bit for inlink descriptor error.*/
#define SPI_MEM_INLINK_DSCR_ERROR_INT_CLR  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_CLR_M  (BIT(2))
#define SPI_MEM_INLINK_DSCR_ERROR_INT_CLR_V  0x1
#define SPI_MEM_INLINK_DSCR_ERROR_INT_CLR_S  2
/* SPI_MEM_OUTLINK_DSCR_ERROR_INT_CLR : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The clear bit for outlink descriptor error.*/
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_CLR  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_CLR_M  (BIT(1))
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_CLR_V  0x1
#define SPI_MEM_OUTLINK_DSCR_ERROR_INT_CLR_S  1
/* SPI_MEM_INLINK_DSCR_EMPTY_INT_CLR : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The clear bit for lack of enough inlink descriptors.*/
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_CLR  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_CLR_M  (BIT(0))
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_CLR_V  0x1
#define SPI_MEM_INLINK_DSCR_EMPTY_INT_CLR_S  0

#define SPI_MEM_IN_ERR_EOF_DES_ADDR_REG(i)          (REG_SPI_BASE(i) + 0x078)
/* SPI_MEM_DMA_IN_ERR_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The inlink descriptor address when spi dma produce receiving error.*/
#define SPI_MEM_DMA_IN_ERR_EOF_DES_ADDR  0xFFFFFFFF
#define SPI_MEM_DMA_IN_ERR_EOF_DES_ADDR_M  ((SPI_MEM_DMA_IN_ERR_EOF_DES_ADDR_V)<<(SPI_MEM_DMA_IN_ERR_EOF_DES_ADDR_S))
#define SPI_MEM_DMA_IN_ERR_EOF_DES_ADDR_V  0xFFFFFFFF
#define SPI_MEM_DMA_IN_ERR_EOF_DES_ADDR_S  0

#define SPI_MEM_IN_SUC_EOF_DES_ADDR_REG(i)          (REG_SPI_BASE(i) + 0x07C)
/* SPI_MEM_DMA_IN_SUC_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The last inlink descriptor address when spi dma produce from_suc_eof.*/
#define SPI_MEM_DMA_IN_SUC_EOF_DES_ADDR  0xFFFFFFFF
#define SPI_MEM_DMA_IN_SUC_EOF_DES_ADDR_M  ((SPI_MEM_DMA_IN_SUC_EOF_DES_ADDR_V)<<(SPI_MEM_DMA_IN_SUC_EOF_DES_ADDR_S))
#define SPI_MEM_DMA_IN_SUC_EOF_DES_ADDR_V  0xFFFFFFFF
#define SPI_MEM_DMA_IN_SUC_EOF_DES_ADDR_S  0

#define SPI_MEM_INLINK_DSCR_REG(i)          (REG_SPI_BASE(i) + 0x080)
/* SPI_MEM_DMA_INLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The content of current in descriptor pointer.*/
#define SPI_MEM_DMA_INLINK_DSCR  0xFFFFFFFF
#define SPI_MEM_DMA_INLINK_DSCR_M  ((SPI_MEM_DMA_INLINK_DSCR_V)<<(SPI_MEM_DMA_INLINK_DSCR_S))
#define SPI_MEM_DMA_INLINK_DSCR_V  0xFFFFFFFF
#define SPI_MEM_DMA_INLINK_DSCR_S  0

#define SPI_MEM_INLINK_DSCR_BF0_REG(i)          (REG_SPI_BASE(i) + 0x084)
/* SPI_MEM_DMA_INLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The content of next in descriptor pointer.*/
#define SPI_MEM_DMA_INLINK_DSCR_BF0  0xFFFFFFFF
#define SPI_MEM_DMA_INLINK_DSCR_BF0_M  ((SPI_MEM_DMA_INLINK_DSCR_BF0_V)<<(SPI_MEM_DMA_INLINK_DSCR_BF0_S))
#define SPI_MEM_DMA_INLINK_DSCR_BF0_V  0xFFFFFFFF
#define SPI_MEM_DMA_INLINK_DSCR_BF0_S  0

#define SPI_MEM_INLINK_DSCR_BF1_REG(i)          (REG_SPI_BASE(i) + 0x088)
/* SPI_MEM_DMA_INLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The content of current in descriptor data buffer pointer.*/
#define SPI_MEM_DMA_INLINK_DSCR_BF1  0xFFFFFFFF
#define SPI_MEM_DMA_INLINK_DSCR_BF1_M  ((SPI_MEM_DMA_INLINK_DSCR_BF1_V)<<(SPI_MEM_DMA_INLINK_DSCR_BF1_S))
#define SPI_MEM_DMA_INLINK_DSCR_BF1_V  0xFFFFFFFF
#define SPI_MEM_DMA_INLINK_DSCR_BF1_S  0

#define SPI_MEM_OUT_EOF_BFR_DES_ADDR_REG(i)          (REG_SPI_BASE(i) + 0x08C)
/* SPI_MEM_DMA_OUT_EOF_BFR_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of buffer relative to the outlink descriptor that produce eof.*/
#define SPI_MEM_DMA_OUT_EOF_BFR_DES_ADDR  0xFFFFFFFF
#define SPI_MEM_DMA_OUT_EOF_BFR_DES_ADDR_M  ((SPI_MEM_DMA_OUT_EOF_BFR_DES_ADDR_V)<<(SPI_MEM_DMA_OUT_EOF_BFR_DES_ADDR_S))
#define SPI_MEM_DMA_OUT_EOF_BFR_DES_ADDR_V  0xFFFFFFFF
#define SPI_MEM_DMA_OUT_EOF_BFR_DES_ADDR_S  0

#define SPI_MEM_OUT_EOF_DES_ADDR_REG(i)          (REG_SPI_BASE(i) + 0x090)
/* SPI_MEM_DMA_OUT_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The last outlink descriptor address when spi dma produce to_eof.*/
#define SPI_MEM_DMA_OUT_EOF_DES_ADDR  0xFFFFFFFF
#define SPI_MEM_DMA_OUT_EOF_DES_ADDR_M  ((SPI_MEM_DMA_OUT_EOF_DES_ADDR_V)<<(SPI_MEM_DMA_OUT_EOF_DES_ADDR_S))
#define SPI_MEM_DMA_OUT_EOF_DES_ADDR_V  0xFFFFFFFF
#define SPI_MEM_DMA_OUT_EOF_DES_ADDR_S  0

#define SPI_MEM_OUTLINK_DSCR_REG(i)          (REG_SPI_BASE(i) + 0x094)
/* SPI_MEM_DMA_OUTLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The content of current out descriptor pointer.*/
#define SPI_MEM_DMA_OUTLINK_DSCR  0xFFFFFFFF
#define SPI_MEM_DMA_OUTLINK_DSCR_M  ((SPI_MEM_DMA_OUTLINK_DSCR_V)<<(SPI_MEM_DMA_OUTLINK_DSCR_S))
#define SPI_MEM_DMA_OUTLINK_DSCR_V  0xFFFFFFFF
#define SPI_MEM_DMA_OUTLINK_DSCR_S  0

#define SPI_MEM_OUTLINK_DSCR_BF0_REG(i)          (REG_SPI_BASE(i) + 0x098)
/* SPI_MEM_DMA_OUTLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The content of next out descriptor pointer.*/
#define SPI_MEM_DMA_OUTLINK_DSCR_BF0  0xFFFFFFFF
#define SPI_MEM_DMA_OUTLINK_DSCR_BF0_M  ((SPI_MEM_DMA_OUTLINK_DSCR_BF0_V)<<(SPI_MEM_DMA_OUTLINK_DSCR_BF0_S))
#define SPI_MEM_DMA_OUTLINK_DSCR_BF0_V  0xFFFFFFFF
#define SPI_MEM_DMA_OUTLINK_DSCR_BF0_S  0

#define SPI_MEM_OUTLINK_DSCR_BF1_REG(i)          (REG_SPI_BASE(i) + 0x09C)
/* SPI_MEM_DMA_OUTLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The content of current out descriptor data buffer pointer.*/
#define SPI_MEM_DMA_OUTLINK_DSCR_BF1  0xFFFFFFFF
#define SPI_MEM_DMA_OUTLINK_DSCR_BF1_M  ((SPI_MEM_DMA_OUTLINK_DSCR_BF1_V)<<(SPI_MEM_DMA_OUTLINK_DSCR_BF1_S))
#define SPI_MEM_DMA_OUTLINK_DSCR_BF1_V  0xFFFFFFFF
#define SPI_MEM_DMA_OUTLINK_DSCR_BF1_S  0

