foxval/esp-idf/components/soc/esp32c/include/soc/spi_mem_reg.h
#define SPI_MEM_DMA_OUTSTATUS_REG(i)          (REG_SPI_BASE(i) + 0x0A0)
/* SPI_MEM_DMA_OUTFIFO_EMPTY : RO ;bitpos:[31] ;default: 1'b1 ; */
/*description: SPI dma outfifo is empty.*/
#define SPI_MEM_DMA_OUTFIFO_EMPTY  (BIT(31))
#define SPI_MEM_DMA_OUTFIFO_EMPTY_M  (BIT(31))
#define SPI_MEM_DMA_OUTFIFO_EMPTY_V  0x1
#define SPI_MEM_DMA_OUTFIFO_EMPTY_S  31
/* SPI_MEM_DMA_OUTFIFO_FULL : RO ;bitpos:[30] ;default: 1'b0 ; */
/*description: SPI dma outfifo is full.*/
#define SPI_MEM_DMA_OUTFIFO_FULL  (BIT(30))
#define SPI_MEM_DMA_OUTFIFO_FULL_M  (BIT(30))
#define SPI_MEM_DMA_OUTFIFO_FULL_V  0x1
#define SPI_MEM_DMA_OUTFIFO_FULL_S  30
/* SPI_MEM_DMA_OUTFIFO_CNT : RO ;bitpos:[29:23] ;default: 7'b0 ; */
/*description: The remains of SPI dma outfifo data.*/
#define SPI_MEM_DMA_OUTFIFO_CNT  0x0000007F
#define SPI_MEM_DMA_OUTFIFO_CNT_M  ((SPI_MEM_DMA_OUTFIFO_CNT_V)<<(SPI_MEM_DMA_OUTFIFO_CNT_S))
#define SPI_MEM_DMA_OUTFIFO_CNT_V  0x7F
#define SPI_MEM_DMA_OUTFIFO_CNT_S  23
/* SPI_MEM_DMA_OUT_STATE : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: SPI dma out data state.*/
#define SPI_MEM_DMA_OUT_STATE  0x00000007
#define SPI_MEM_DMA_OUT_STATE_M  ((SPI_MEM_DMA_OUT_STATE_V)<<(SPI_MEM_DMA_OUT_STATE_S))
#define SPI_MEM_DMA_OUT_STATE_V  0x7
#define SPI_MEM_DMA_OUT_STATE_S  20
/* SPI_MEM_DMA_OUTDSCR_STATE : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: SPI dma out descriptor state.*/
#define SPI_MEM_DMA_OUTDSCR_STATE  0x00000003
#define SPI_MEM_DMA_OUTDSCR_STATE_M  ((SPI_MEM_DMA_OUTDSCR_STATE_V)<<(SPI_MEM_DMA_OUTDSCR_STATE_S))
#define SPI_MEM_DMA_OUTDSCR_STATE_V  0x3
#define SPI_MEM_DMA_OUTDSCR_STATE_S  18
/* SPI_MEM_DMA_OUTDSCR_ADDR : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: SPI dma out descriptor address.*/
#define SPI_MEM_DMA_OUTDSCR_ADDR  0x0003FFFF
#define SPI_MEM_DMA_OUTDSCR_ADDR_M  ((SPI_MEM_DMA_OUTDSCR_ADDR_V)<<(SPI_MEM_DMA_OUTDSCR_ADDR_S))
#define SPI_MEM_DMA_OUTDSCR_ADDR_V  0x3FFFF
#define SPI_MEM_DMA_OUTDSCR_ADDR_S  0

#define SPI_MEM_DMA_INSTATUS_REG(i)          (REG_SPI_BASE(i) + 0x0A4)
/* SPI_MEM_DMA_INFIFO_EMPTY : RO ;bitpos:[31] ;default: 1'b1 ; */
/*description: SPI dma infifo is empty.*/
#define SPI_MEM_DMA_INFIFO_EMPTY  (BIT(31))
#define SPI_MEM_DMA_INFIFO_EMPTY_M  (BIT(31))
#define SPI_MEM_DMA_INFIFO_EMPTY_V  0x1
#define SPI_MEM_DMA_INFIFO_EMPTY_S  31
/* SPI_MEM_DMA_INFIFO_FULL : RO ;bitpos:[30] ;default: 1'b0 ; */
/*description: SPI dma infifo is full.*/
#define SPI_MEM_DMA_INFIFO_FULL  (BIT(30))
#define SPI_MEM_DMA_INFIFO_FULL_M  (BIT(30))
#define SPI_MEM_DMA_INFIFO_FULL_V  0x1
#define SPI_MEM_DMA_INFIFO_FULL_S  30
/* SPI_MEM_DMA_INFIFO_CNT : RO ;bitpos:[29:23] ;default: 7'b0 ; */
/*description: The remains of SPI dma infifo data.*/
#define SPI_MEM_DMA_INFIFO_CNT  0x0000007F
#define SPI_MEM_DMA_INFIFO_CNT_M  ((SPI_MEM_DMA_INFIFO_CNT_V)<<(SPI_MEM_DMA_INFIFO_CNT_S))
#define SPI_MEM_DMA_INFIFO_CNT_V  0x7F
#define SPI_MEM_DMA_INFIFO_CNT_S  23
/* SPI_MEM_DMA_IN_STATE : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: SPI dma in data state.*/
#define SPI_MEM_DMA_IN_STATE  0x00000007
#define SPI_MEM_DMA_IN_STATE_M  ((SPI_MEM_DMA_IN_STATE_V)<<(SPI_MEM_DMA_IN_STATE_S))
#define SPI_MEM_DMA_IN_STATE_V  0x7
#define SPI_MEM_DMA_IN_STATE_S  20
/* SPI_MEM_DMA_INDSCR_STATE : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: SPI dma in descriptor state.*/
#define SPI_MEM_DMA_INDSCR_STATE  0x00000003
#define SPI_MEM_DMA_INDSCR_STATE_M  ((SPI_MEM_DMA_INDSCR_STATE_V)<<(SPI_MEM_DMA_INDSCR_STATE_S))
#define SPI_MEM_DMA_INDSCR_STATE_V  0x3
#define SPI_MEM_DMA_INDSCR_STATE_S  18
/* SPI_MEM_DMA_INDSCR_ADDR : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: SPI dma in descriptor address.*/
#define SPI_MEM_DMA_INDSCR_ADDR  0x0003FFFF
#define SPI_MEM_DMA_INDSCR_ADDR_M  ((SPI_MEM_DMA_INDSCR_ADDR_V)<<(SPI_MEM_DMA_INDSCR_ADDR_S))
#define SPI_MEM_DMA_INDSCR_ADDR_V  0x3FFFF
#define SPI_MEM_DMA_INDSCR_ADDR_S  0

#define SPI_MEM_W0_REG(i)          (REG_SPI_BASE(i) + 0x0A8)
/* SPI_MEM_BUF0 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF0  0xFFFFFFFF
#define SPI_MEM_BUF0_M  ((SPI_MEM_BUF0_V)<<(SPI_MEM_BUF0_S))
#define SPI_MEM_BUF0_V  0xFFFFFFFF
#define SPI_MEM_BUF0_S  0

#define SPI_MEM_W1_REG(i)          (REG_SPI_BASE(i) + 0x0AC)
/* SPI_MEM_BUF1 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF1  0xFFFFFFFF
#define SPI_MEM_BUF1_M  ((SPI_MEM_BUF1_V)<<(SPI_MEM_BUF1_S))
#define SPI_MEM_BUF1_V  0xFFFFFFFF
#define SPI_MEM_BUF1_S  0

#define SPI_MEM_W2_REG(i)          (REG_SPI_BASE(i) + 0x0B0)
/* SPI_MEM_BUF2 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF2  0xFFFFFFFF
#define SPI_MEM_BUF2_M  ((SPI_MEM_BUF2_V)<<(SPI_MEM_BUF2_S))
#define SPI_MEM_BUF2_V  0xFFFFFFFF
#define SPI_MEM_BUF2_S  0

#define SPI_MEM_W3_REG(i)          (REG_SPI_BASE(i) + 0x0B4)
/* SPI_MEM_BUF3 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF3  0xFFFFFFFF
#define SPI_MEM_BUF3_M  ((SPI_MEM_BUF3_V)<<(SPI_MEM_BUF3_S))
#define SPI_MEM_BUF3_V  0xFFFFFFFF
#define SPI_MEM_BUF3_S  0

#define SPI_MEM_W4_REG(i)          (REG_SPI_BASE(i) + 0x0B8)
/* SPI_MEM_BUF4 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF4  0xFFFFFFFF
#define SPI_MEM_BUF4_M  ((SPI_MEM_BUF4_V)<<(SPI_MEM_BUF4_S))
#define SPI_MEM_BUF4_V  0xFFFFFFFF
#define SPI_MEM_BUF4_S  0

#define SPI_MEM_W5_REG(i)          (REG_SPI_BASE(i) + 0x0BC)
/* SPI_MEM_BUF5 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF5  0xFFFFFFFF
#define SPI_MEM_BUF5_M  ((SPI_MEM_BUF5_V)<<(SPI_MEM_BUF5_S))
#define SPI_MEM_BUF5_V  0xFFFFFFFF
#define SPI_MEM_BUF5_S  0

#define SPI_MEM_W6_REG(i)          (REG_SPI_BASE(i) + 0x0C0)
/* SPI_MEM_BUF6 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF6  0xFFFFFFFF
#define SPI_MEM_BUF6_M  ((SPI_MEM_BUF6_V)<<(SPI_MEM_BUF6_S))
#define SPI_MEM_BUF6_V  0xFFFFFFFF
#define SPI_MEM_BUF6_S  0

#define SPI_MEM_W7_REG(i)          (REG_SPI_BASE(i) + 0x0C4)
/* SPI_MEM_BUF7 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF7  0xFFFFFFFF
#define SPI_MEM_BUF7_M  ((SPI_MEM_BUF7_V)<<(SPI_MEM_BUF7_S))
#define SPI_MEM_BUF7_V  0xFFFFFFFF
#define SPI_MEM_BUF7_S  0

#define SPI_MEM_W8_REG(i)          (REG_SPI_BASE(i) + 0x0C8)
/* SPI_MEM_BUF8 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF8  0xFFFFFFFF
#define SPI_MEM_BUF8_M  ((SPI_MEM_BUF8_V)<<(SPI_MEM_BUF8_S))
#define SPI_MEM_BUF8_V  0xFFFFFFFF
#define SPI_MEM_BUF8_S  0

