foxval/esp-idf/components/soc/esp32c/include/soc/spi_mem_reg.h
#define SPI_MEM_W9_REG(i)          (REG_SPI_BASE(i) + 0x0CC)
/* SPI_MEM_BUF9 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF9  0xFFFFFFFF
#define SPI_MEM_BUF9_M  ((SPI_MEM_BUF9_V)<<(SPI_MEM_BUF9_S))
#define SPI_MEM_BUF9_V  0xFFFFFFFF
#define SPI_MEM_BUF9_S  0

#define SPI_MEM_W10_REG(i)          (REG_SPI_BASE(i) + 0x0D0)
/* SPI_MEM_BUF10 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF10  0xFFFFFFFF
#define SPI_MEM_BUF10_M  ((SPI_MEM_BUF10_V)<<(SPI_MEM_BUF10_S))
#define SPI_MEM_BUF10_V  0xFFFFFFFF
#define SPI_MEM_BUF10_S  0

#define SPI_MEM_W11_REG(i)          (REG_SPI_BASE(i) + 0x0D4)
/* SPI_MEM_BUF11 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF11  0xFFFFFFFF
#define SPI_MEM_BUF11_M  ((SPI_MEM_BUF11_V)<<(SPI_MEM_BUF11_S))
#define SPI_MEM_BUF11_V  0xFFFFFFFF
#define SPI_MEM_BUF11_S  0

#define SPI_MEM_W12_REG(i)          (REG_SPI_BASE(i) + 0x0D8)
/* SPI_MEM_BUF12 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF12  0xFFFFFFFF
#define SPI_MEM_BUF12_M  ((SPI_MEM_BUF12_V)<<(SPI_MEM_BUF12_S))
#define SPI_MEM_BUF12_V  0xFFFFFFFF
#define SPI_MEM_BUF12_S  0

#define SPI_MEM_W13_REG(i)          (REG_SPI_BASE(i) + 0x0DC)
/* SPI_MEM_BUF13 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF13  0xFFFFFFFF
#define SPI_MEM_BUF13_M  ((SPI_MEM_BUF13_V)<<(SPI_MEM_BUF13_S))
#define SPI_MEM_BUF13_V  0xFFFFFFFF
#define SPI_MEM_BUF13_S  0

#define SPI_MEM_W14_REG(i)          (REG_SPI_BASE(i) + 0x0E0)
/* SPI_MEM_BUF14 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF14  0xFFFFFFFF
#define SPI_MEM_BUF14_M  ((SPI_MEM_BUF14_V)<<(SPI_MEM_BUF14_S))
#define SPI_MEM_BUF14_V  0xFFFFFFFF
#define SPI_MEM_BUF14_S  0

#define SPI_MEM_W15_REG(i)          (REG_SPI_BASE(i) + 0x0E4)
/* SPI_MEM_BUF15 : SRW ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: data buffer*/
#define SPI_MEM_BUF15  0xFFFFFFFF
#define SPI_MEM_BUF15_M  ((SPI_MEM_BUF15_V)<<(SPI_MEM_BUF15_S))
#define SPI_MEM_BUF15_V  0xFFFFFFFF
#define SPI_MEM_BUF15_S  0

#define SPI_MEM_FLASH_WAITI_CTRL_REG(i)          (REG_SPI_BASE(i) + 0x0E8)
/* SPI_MEM_WAITI_DUMMY_CYCLELEN : R/W ;bitpos:[17:10] ;default: 8'h0 ; */
/*description: The dummy cycle length when auto wait flash idle*/
#define SPI_MEM_WAITI_DUMMY_CYCLELEN  0x000000FF
#define SPI_MEM_WAITI_DUMMY_CYCLELEN_M  ((SPI_MEM_WAITI_DUMMY_CYCLELEN_V)<<(SPI_MEM_WAITI_DUMMY_CYCLELEN_S))
#define SPI_MEM_WAITI_DUMMY_CYCLELEN_V  0xFF
#define SPI_MEM_WAITI_DUMMY_CYCLELEN_S  10
/* SPI_MEM_WAITI_CMD : R/W ;bitpos:[9:2] ;default: 8'h05 ; */
/*description: The command to auto wait idle*/
#define SPI_MEM_WAITI_CMD  0x000000FF
#define SPI_MEM_WAITI_CMD_M  ((SPI_MEM_WAITI_CMD_V)<<(SPI_MEM_WAITI_CMD_S))
#define SPI_MEM_WAITI_CMD_V  0xFF
#define SPI_MEM_WAITI_CMD_S  2
/* SPI_MEM_WAITI_DUMMY : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The dummy phase enable when auto wait flash idle*/
#define SPI_MEM_WAITI_DUMMY  (BIT(1))
#define SPI_MEM_WAITI_DUMMY_M  (BIT(1))
#define SPI_MEM_WAITI_DUMMY_V  0x1
#define SPI_MEM_WAITI_DUMMY_S  1
/* SPI_MEM_WAITI_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: auto-waiting flash idle operation when program flash or erase
 flash. 1: enable 0: disable.*/
#define SPI_MEM_WAITI_EN  (BIT(0))
#define SPI_MEM_WAITI_EN_M  (BIT(0))
#define SPI_MEM_WAITI_EN_V  0x1
#define SPI_MEM_WAITI_EN_S  0

#define SPI_MEM_FLASH_SUS_CMD_REG(i)          (REG_SPI_BASE(i) + 0x0EC)
/* SPI_MEM_FLASH_PES : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: program erase suspend bit  program erase suspend operation will
 be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_PES  (BIT(1))
#define SPI_MEM_FLASH_PES_M  (BIT(1))
#define SPI_MEM_FLASH_PES_V  0x1
#define SPI_MEM_FLASH_PES_S  1
/* SPI_MEM_FLASH_PER : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: program erase resume bit  program erase suspend operation will
 be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.*/
#define SPI_MEM_FLASH_PER  (BIT(0))
#define SPI_MEM_FLASH_PER_M  (BIT(0))
#define SPI_MEM_FLASH_PER_V  0x1
#define SPI_MEM_FLASH_PER_S  0

#define SPI_MEM_FLASH_SUS_CTRL_REG(i)          (REG_SPI_BASE(i) + 0x0F0)
/* SPI_MEM_FLASH_PES_COMMAND : R/W ;bitpos:[16:9] ;default: 8'h75 ; */
/*description: Program/Erase suspend command.*/
#define SPI_MEM_FLASH_PES_COMMAND  0x000000FF
#define SPI_MEM_FLASH_PES_COMMAND_M  ((SPI_MEM_FLASH_PES_COMMAND_V)<<(SPI_MEM_FLASH_PES_COMMAND_S))
#define SPI_MEM_FLASH_PES_COMMAND_V  0xFF
#define SPI_MEM_FLASH_PES_COMMAND_S  9
/* SPI_MEM_FLASH_PER_COMMAND : R/W ;bitpos:[8:1] ;default: 8'h7a ; */
/*description: Program/Erase resume command.*/
#define SPI_MEM_FLASH_PER_COMMAND  0x000000FF
#define SPI_MEM_FLASH_PER_COMMAND_M  ((SPI_MEM_FLASH_PER_COMMAND_V)<<(SPI_MEM_FLASH_PER_COMMAND_S))
#define SPI_MEM_FLASH_PER_COMMAND_V  0xFF
#define SPI_MEM_FLASH_PER_COMMAND_S  1
/* SPI_MEM_FLASH_PES_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Auto-suspending enable*/
#define SPI_MEM_FLASH_PES_EN  (BIT(0))
#define SPI_MEM_FLASH_PES_EN_M  (BIT(0))
#define SPI_MEM_FLASH_PES_EN_V  0x1
#define SPI_MEM_FLASH_PES_EN_S  0

#define SPI_MEM_DIN_MODE_REG(i)          (REG_SPI_BASE(i) + 0x0F4)
/* SPI_MEM_DIN3_DLY_EDGE : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_DIN3_DLY_EDGE  (BIT(21))
#define SPI_MEM_DIN3_DLY_EDGE_M  (BIT(21))
#define SPI_MEM_DIN3_DLY_EDGE_V  0x1
#define SPI_MEM_DIN3_DLY_EDGE_S  21
/* SPI_MEM_DIN2_DLY_EDGE : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_DIN2_DLY_EDGE  (BIT(20))
#define SPI_MEM_DIN2_DLY_EDGE_M  (BIT(20))
#define SPI_MEM_DIN2_DLY_EDGE_V  0x1
#define SPI_MEM_DIN2_DLY_EDGE_S  20
/* SPI_MEM_DIN1_DLY_EDGE : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_DIN1_DLY_EDGE  (BIT(19))
#define SPI_MEM_DIN1_DLY_EDGE_M  (BIT(19))
#define SPI_MEM_DIN1_DLY_EDGE_V  0x1
#define SPI_MEM_DIN1_DLY_EDGE_S  19
/* SPI_MEM_DIN0_DLY_EDGE : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_DIN0_DLY_EDGE  (BIT(18))
#define SPI_MEM_DIN0_DLY_EDGE_M  (BIT(18))
#define SPI_MEM_DIN0_DLY_EDGE_V  0x1
#define SPI_MEM_DIN0_DLY_EDGE_S  18
/* SPI_MEM_DIN3_MODE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN3_MODE  0x00000003
#define SPI_MEM_DIN3_MODE_M  ((SPI_MEM_DIN3_MODE_V)<<(SPI_MEM_DIN3_MODE_S))
#define SPI_MEM_DIN3_MODE_V  0x3
#define SPI_MEM_DIN3_MODE_S  6
/* SPI_MEM_DIN2_MODE : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN2_MODE  0x00000003
#define SPI_MEM_DIN2_MODE_M  ((SPI_MEM_DIN2_MODE_V)<<(SPI_MEM_DIN2_MODE_S))
#define SPI_MEM_DIN2_MODE_V  0x3
#define SPI_MEM_DIN2_MODE_S  4
/* SPI_MEM_DIN1_MODE : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN1_MODE  0x00000003
#define SPI_MEM_DIN1_MODE_M  ((SPI_MEM_DIN1_MODE_V)<<(SPI_MEM_DIN1_MODE_S))
#define SPI_MEM_DIN1_MODE_V  0x3
#define SPI_MEM_DIN1_MODE_S  2
/* SPI_MEM_DIN0_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_DIN0_MODE  0x00000003
#define SPI_MEM_DIN0_MODE_M  ((SPI_MEM_DIN0_MODE_V)<<(SPI_MEM_DIN0_MODE_S))
#define SPI_MEM_DIN0_MODE_V  0x3
#define SPI_MEM_DIN0_MODE_S  0

#define SPI_MEM_DIN_NUM_REG(i)          (REG_SPI_BASE(i) + 0x0F8)
/* SPI_MEM_DIN3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN3_NUM  0x00000003
#define SPI_MEM_DIN3_NUM_M  ((SPI_MEM_DIN3_NUM_V)<<(SPI_MEM_DIN3_NUM_S))
#define SPI_MEM_DIN3_NUM_V  0x3
#define SPI_MEM_DIN3_NUM_S  6
/* SPI_MEM_DIN2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN2_NUM  0x00000003
#define SPI_MEM_DIN2_NUM_M  ((SPI_MEM_DIN2_NUM_V)<<(SPI_MEM_DIN2_NUM_S))
#define SPI_MEM_DIN2_NUM_V  0x3
#define SPI_MEM_DIN2_NUM_S  4
/* SPI_MEM_DIN1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN1_NUM  0x00000003
#define SPI_MEM_DIN1_NUM_M  ((SPI_MEM_DIN1_NUM_V)<<(SPI_MEM_DIN1_NUM_S))
#define SPI_MEM_DIN1_NUM_V  0x3
#define SPI_MEM_DIN1_NUM_S  2
/* SPI_MEM_DIN0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DIN0_NUM  0x00000003
#define SPI_MEM_DIN0_NUM_M  ((SPI_MEM_DIN0_NUM_V)<<(SPI_MEM_DIN0_NUM_S))
#define SPI_MEM_DIN0_NUM_V  0x3
#define SPI_MEM_DIN0_NUM_S  0

#define SPI_MEM_DOUT_MODE_REG(i)          (REG_SPI_BASE(i) + 0x0FC)
/* SPI_MEM_DOUT3_DLY_EDGE : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_DOUT3_DLY_EDGE  (BIT(21))
#define SPI_MEM_DOUT3_DLY_EDGE_M  (BIT(21))
#define SPI_MEM_DOUT3_DLY_EDGE_V  0x1
#define SPI_MEM_DOUT3_DLY_EDGE_S  21
/* SPI_MEM_DOUT2_DLY_EDGE : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_DOUT2_DLY_EDGE  (BIT(20))
#define SPI_MEM_DOUT2_DLY_EDGE_M  (BIT(20))
#define SPI_MEM_DOUT2_DLY_EDGE_V  0x1
#define SPI_MEM_DOUT2_DLY_EDGE_S  20
/* SPI_MEM_DOUT1_DLY_EDGE : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_DOUT1_DLY_EDGE  (BIT(19))
#define SPI_MEM_DOUT1_DLY_EDGE_M  (BIT(19))
#define SPI_MEM_DOUT1_DLY_EDGE_V  0x1
#define SPI_MEM_DOUT1_DLY_EDGE_S  19
/* SPI_MEM_DOUT0_DLY_EDGE : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_DOUT0_DLY_EDGE  (BIT(18))
#define SPI_MEM_DOUT0_DLY_EDGE_M  (BIT(18))
#define SPI_MEM_DOUT0_DLY_EDGE_V  0x1
#define SPI_MEM_DOUT0_DLY_EDGE_S  18
/* SPI_MEM_DOUT3_MODE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT3_MODE  0x00000003
#define SPI_MEM_DOUT3_MODE_M  ((SPI_MEM_DOUT3_MODE_V)<<(SPI_MEM_DOUT3_MODE_S))
#define SPI_MEM_DOUT3_MODE_V  0x3
#define SPI_MEM_DOUT3_MODE_S  6
/* SPI_MEM_DOUT2_MODE : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT2_MODE  0x00000003
#define SPI_MEM_DOUT2_MODE_M  ((SPI_MEM_DOUT2_MODE_V)<<(SPI_MEM_DOUT2_MODE_S))
#define SPI_MEM_DOUT2_MODE_V  0x3
#define SPI_MEM_DOUT2_MODE_S  4
/* SPI_MEM_DOUT1_MODE : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT1_MODE  0x00000003
#define SPI_MEM_DOUT1_MODE_M  ((SPI_MEM_DOUT1_MODE_V)<<(SPI_MEM_DOUT1_MODE_S))
#define SPI_MEM_DOUT1_MODE_V  0x3
#define SPI_MEM_DOUT1_MODE_S  2
/* SPI_MEM_DOUT0_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_DOUT0_MODE  0x00000003
#define SPI_MEM_DOUT0_MODE_M  ((SPI_MEM_DOUT0_MODE_V)<<(SPI_MEM_DOUT0_MODE_S))
#define SPI_MEM_DOUT0_MODE_V  0x3
#define SPI_MEM_DOUT0_MODE_S  0

#define SPI_MEM_DOUT_NUM_REG(i)          (REG_SPI_BASE(i) + 0x100)
/* SPI_MEM_DOUT3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DOUT3_NUM  0x00000003
#define SPI_MEM_DOUT3_NUM_M  ((SPI_MEM_DOUT3_NUM_V)<<(SPI_MEM_DOUT3_NUM_S))
#define SPI_MEM_DOUT3_NUM_V  0x3
#define SPI_MEM_DOUT3_NUM_S  6
/* SPI_MEM_DOUT2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DOUT2_NUM  0x00000003
#define SPI_MEM_DOUT2_NUM_M  ((SPI_MEM_DOUT2_NUM_V)<<(SPI_MEM_DOUT2_NUM_S))
#define SPI_MEM_DOUT2_NUM_V  0x3
#define SPI_MEM_DOUT2_NUM_S  4
/* SPI_MEM_DOUT1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DOUT1_NUM  0x00000003
#define SPI_MEM_DOUT1_NUM_M  ((SPI_MEM_DOUT1_NUM_V)<<(SPI_MEM_DOUT1_NUM_S))
#define SPI_MEM_DOUT1_NUM_V  0x3
#define SPI_MEM_DOUT1_NUM_S  2
/* SPI_MEM_DOUT0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_DOUT0_NUM  0x00000003
#define SPI_MEM_DOUT0_NUM_M  ((SPI_MEM_DOUT0_NUM_V)<<(SPI_MEM_DOUT0_NUM_S))
#define SPI_MEM_DOUT0_NUM_V  0x3
#define SPI_MEM_DOUT0_NUM_S  0

#define SPI_MEM_SDIN_MODE_REG(i)          (REG_SPI_BASE(i) + 0x104)
/* SPI_MEM_SDIN3_DLY_EDGE : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_SDIN3_DLY_EDGE  (BIT(21))
#define SPI_MEM_SDIN3_DLY_EDGE_M  (BIT(21))
#define SPI_MEM_SDIN3_DLY_EDGE_V  0x1
#define SPI_MEM_SDIN3_DLY_EDGE_S  21
/* SPI_MEM_SDIN2_DLY_EDGE : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_SDIN2_DLY_EDGE  (BIT(20))
#define SPI_MEM_SDIN2_DLY_EDGE_M  (BIT(20))
#define SPI_MEM_SDIN2_DLY_EDGE_V  0x1
#define SPI_MEM_SDIN2_DLY_EDGE_S  20
/* SPI_MEM_SDIN1_DLY_EDGE : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_SDIN1_DLY_EDGE  (BIT(19))
#define SPI_MEM_SDIN1_DLY_EDGE_M  (BIT(19))
#define SPI_MEM_SDIN1_DLY_EDGE_V  0x1
#define SPI_MEM_SDIN1_DLY_EDGE_S  19
/* SPI_MEM_SDIN0_DLY_EDGE : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify input line timing.*/
#define SPI_MEM_SDIN0_DLY_EDGE  (BIT(18))
#define SPI_MEM_SDIN0_DLY_EDGE_M  (BIT(18))
#define SPI_MEM_SDIN0_DLY_EDGE_V  0x1
#define SPI_MEM_SDIN0_DLY_EDGE_S  18
/* SPI_MEM_SDIN3_MODE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_SDIN3_MODE  0x00000003
#define SPI_MEM_SDIN3_MODE_M  ((SPI_MEM_SDIN3_MODE_V)<<(SPI_MEM_SDIN3_MODE_S))
#define SPI_MEM_SDIN3_MODE_V  0x3
#define SPI_MEM_SDIN3_MODE_S  6
/* SPI_MEM_SDIN2_MODE : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_SDIN2_MODE  0x00000003
#define SPI_MEM_SDIN2_MODE_M  ((SPI_MEM_SDIN2_MODE_V)<<(SPI_MEM_SDIN2_MODE_S))
#define SPI_MEM_SDIN2_MODE_V  0x3
#define SPI_MEM_SDIN2_MODE_S  4
/* SPI_MEM_SDIN1_MODE : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_SDIN1_MODE  0x00000003
#define SPI_MEM_SDIN1_MODE_M  ((SPI_MEM_SDIN1_MODE_V)<<(SPI_MEM_SDIN1_MODE_S))
#define SPI_MEM_SDIN1_MODE_V  0x3
#define SPI_MEM_SDIN1_MODE_S  2
/* SPI_MEM_SDIN0_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: input
 without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
#define SPI_MEM_SDIN0_MODE  0x00000003
#define SPI_MEM_SDIN0_MODE_M  ((SPI_MEM_SDIN0_MODE_V)<<(SPI_MEM_SDIN0_MODE_S))
#define SPI_MEM_SDIN0_MODE_V  0x3
#define SPI_MEM_SDIN0_MODE_S  0

#define SPI_MEM_SDIN_NUM_REG(i)          (REG_SPI_BASE(i) + 0x108)
/* SPI_MEM_SDIN3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDIN3_NUM  0x00000003
#define SPI_MEM_SDIN3_NUM_M  ((SPI_MEM_SDIN3_NUM_V)<<(SPI_MEM_SDIN3_NUM_S))
#define SPI_MEM_SDIN3_NUM_V  0x3
#define SPI_MEM_SDIN3_NUM_S  6
/* SPI_MEM_SDIN2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDIN2_NUM  0x00000003
#define SPI_MEM_SDIN2_NUM_M  ((SPI_MEM_SDIN2_NUM_V)<<(SPI_MEM_SDIN2_NUM_S))
#define SPI_MEM_SDIN2_NUM_V  0x3
#define SPI_MEM_SDIN2_NUM_S  4
/* SPI_MEM_SDIN1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDIN1_NUM  0x00000003
#define SPI_MEM_SDIN1_NUM_M  ((SPI_MEM_SDIN1_NUM_V)<<(SPI_MEM_SDIN1_NUM_S))
#define SPI_MEM_SDIN1_NUM_V  0x3
#define SPI_MEM_SDIN1_NUM_S  2
/* SPI_MEM_SDIN0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDIN0_NUM  0x00000003
#define SPI_MEM_SDIN0_NUM_M  ((SPI_MEM_SDIN0_NUM_V)<<(SPI_MEM_SDIN0_NUM_S))
#define SPI_MEM_SDIN0_NUM_V  0x3
#define SPI_MEM_SDIN0_NUM_S  0

#define SPI_MEM_SDOUT_MODE_REG(i)          (REG_SPI_BASE(i) + 0x10C)
/* SPI_MEM_SDOUT3_DLY_EDGE : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_SDOUT3_DLY_EDGE  (BIT(21))
#define SPI_MEM_SDOUT3_DLY_EDGE_M  (BIT(21))
#define SPI_MEM_SDOUT3_DLY_EDGE_V  0x1
#define SPI_MEM_SDOUT3_DLY_EDGE_S  21
/* SPI_MEM_SDOUT2_DLY_EDGE : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_SDOUT2_DLY_EDGE  (BIT(20))
#define SPI_MEM_SDOUT2_DLY_EDGE_M  (BIT(20))
#define SPI_MEM_SDOUT2_DLY_EDGE_V  0x1
#define SPI_MEM_SDOUT2_DLY_EDGE_S  20
/* SPI_MEM_SDOUT1_DLY_EDGE : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_SDOUT1_DLY_EDGE  (BIT(19))
#define SPI_MEM_SDOUT1_DLY_EDGE_M  (BIT(19))
#define SPI_MEM_SDOUT1_DLY_EDGE_V  0x1
#define SPI_MEM_SDOUT1_DLY_EDGE_S  19
/* SPI_MEM_SDOUT0_DLY_EDGE : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to select the spi clock edge to modify output line timing.*/
#define SPI_MEM_SDOUT0_DLY_EDGE  (BIT(18))
#define SPI_MEM_SDOUT0_DLY_EDGE_M  (BIT(18))
#define SPI_MEM_SDOUT0_DLY_EDGE_V  0x1
#define SPI_MEM_SDOUT0_DLY_EDGE_S  18
/* SPI_MEM_SDOUT3_MODE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_SDOUT3_MODE  0x00000003
#define SPI_MEM_SDOUT3_MODE_M  ((SPI_MEM_SDOUT3_MODE_V)<<(SPI_MEM_SDOUT3_MODE_S))
#define SPI_MEM_SDOUT3_MODE_V  0x3
#define SPI_MEM_SDOUT3_MODE_S  6
/* SPI_MEM_SDOUT2_MODE : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_SDOUT2_MODE  0x00000003
#define SPI_MEM_SDOUT2_MODE_M  ((SPI_MEM_SDOUT2_MODE_V)<<(SPI_MEM_SDOUT2_MODE_S))
#define SPI_MEM_SDOUT2_MODE_V  0x3
#define SPI_MEM_SDOUT2_MODE_S  4
/* SPI_MEM_SDOUT1_MODE : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_SDOUT1_MODE  0x00000003
#define SPI_MEM_SDOUT1_MODE_M  ((SPI_MEM_SDOUT1_MODE_V)<<(SPI_MEM_SDOUT1_MODE_S))
#define SPI_MEM_SDOUT1_MODE_V  0x3
#define SPI_MEM_SDOUT1_MODE_S  2
/* SPI_MEM_SDOUT0_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: output
 without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
#define SPI_MEM_SDOUT0_MODE  0x00000003
#define SPI_MEM_SDOUT0_MODE_M  ((SPI_MEM_SDOUT0_MODE_V)<<(SPI_MEM_SDOUT0_MODE_S))
#define SPI_MEM_SDOUT0_MODE_V  0x3
#define SPI_MEM_SDOUT0_MODE_S  0

#define SPI_MEM_SDOUT_NUM_REG(i)          (REG_SPI_BASE(i) + 0x110)
/* SPI_MEM_SDOUT3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDOUT3_NUM  0x00000003
#define SPI_MEM_SDOUT3_NUM_M  ((SPI_MEM_SDOUT3_NUM_V)<<(SPI_MEM_SDOUT3_NUM_S))
#define SPI_MEM_SDOUT3_NUM_V  0x3
#define SPI_MEM_SDOUT3_NUM_S  6
/* SPI_MEM_SDOUT2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDOUT2_NUM  0x00000003
#define SPI_MEM_SDOUT2_NUM_M  ((SPI_MEM_SDOUT2_NUM_V)<<(SPI_MEM_SDOUT2_NUM_S))
#define SPI_MEM_SDOUT2_NUM_V  0x3
#define SPI_MEM_SDOUT2_NUM_S  4
/* SPI_MEM_SDOUT1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDOUT1_NUM  0x00000003
#define SPI_MEM_SDOUT1_NUM_M  ((SPI_MEM_SDOUT1_NUM_V)<<(SPI_MEM_SDOUT1_NUM_S))
#define SPI_MEM_SDOUT1_NUM_V  0x3
#define SPI_MEM_SDOUT1_NUM_S  2
/* SPI_MEM_SDOUT0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the output signals are delayed by system clock cycles  0: delayed
 by 1 cycle  1: delayed by 2 cycles ...*/
#define SPI_MEM_SDOUT0_NUM  0x00000003
#define SPI_MEM_SDOUT0_NUM_M  ((SPI_MEM_SDOUT0_NUM_V)<<(SPI_MEM_SDOUT0_NUM_S))
#define SPI_MEM_SDOUT0_NUM_V  0x3
#define SPI_MEM_SDOUT0_NUM_S  0

#define SPI_CLOCK_GATE_REG(i)          (REG_SPI_BASE(i) + 0x114)
/* SPI_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define SPI_CLK_EN  (BIT(0))
#define SPI_CLK_EN_M  (BIT(0))
#define SPI_CLK_EN_V  0x1
#define SPI_CLK_EN_S  0

#define SPI_MEM_DATE_REG(i)          (REG_SPI_BASE(i) + 0x3FC)
/* SPI_MEM_DATE : R/W ;bitpos:[27:0] ;default: 28'h1809050 ; */
/*description: SPI register version.*/
#define SPI_MEM_DATE  0x0FFFFFFF
#define SPI_MEM_DATE_M  ((SPI_MEM_DATE_V)<<(SPI_MEM_DATE_S))
#define SPI_MEM_DATE_V  0xFFFFFFF
#define SPI_MEM_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_SPI_REG_H_ */


